
# lesson 1 number

# задача 1
# Дана диагональ телевизора в дюймах. Написать программу, определяющую эту же диагональ в сантиметрах 
# (1 дюйм = 2.54 сантиметров).
# Ниже представлен пример для проверки программы 
# на корректностью

# задача 2
# Емкость аккумулятора смартфона составляет N мАч. 
# Написать программу, определяющую минимальную 
# емкость переносного зарядного устройства (powerbank), 
# если необходимо 3 полных заряда смартфона.
# Ниже представлен пример для проверки программы 
# на корректность.

# задача 3
# Напишите программу, которая вычисляем объём шара.

# задача 4
# Написать программу вычисления расстояния 
# между двумя точками.




# lesson_2_string

# Задание 1.
# Пользователь вводит с клавиатуры денежную 
# сумму в рублях и копейках (рубли и копейки вводятся 
# в разные переменные). Сумма может быть введена как 
# правильно (например 19 руб. 90 коп), так и неправильно 
# (например 22 руб. 978 коп). Написать программу, которая, 
# используя только линейный алгоритм, осуществит корректировку введенной денежной суммы в правильную форму.
# Например, если пользователь ввел 11 руб. 150 коп, 
# программа должна вывести на экран сумму 12 руб. 50 коп

# Задание 2.
# Написать программу вычисления объема параллелепипеда. Ниже приведен рекомендуемый вид экрана 
# во время выполнения программы.
# Вычисление объема параллелепипеда.
# Введите исходные данные:
# Длина (см) -> 9;
# Ширина (см) -> 7.5;
# Высота (см) -> 5;
# Объем: 337.50 куб. см.

# Задание 3.
# Зарплата менеджера — 100$ + 5% от продаж. 
# Пользователь вводит с клавиатуры общую сумму сделок менеджера за месяц. 
# Посчитать итоговую зарплату менеджера.

# Задание 4.
# Пользователь вводит с клавиатуры время 
# в секундах, прошедшее с начала дня. Вывести на экран 
# текущее время в часах, минутах и секундах. Посчитать, 
# сколько часов, минут и секунд осталось до полуночию

# Задание 5.
# Пользователь вводит с клавиатуры три числа. 
# Посчитать их сумму, произведение и среднее арифметическое.




# lesson_3_if_else

#о Задание 1. Пльзователь вводит число. Определить, является ли оно четным.

# Задание 2. Пользователь вводит два числа. Вывести на 
# экран меньшее из этих чисел. 

# Задание 3. Пользователь вводит число. Определить, положительное это число, отрицательное или равно нулю.

# Задание 4. Пользователь вводит два числа. Определить, 
# равны ли эти числа, и если нет, вывести их на экран в порядке возрастания

# Задание 5. Пользователь с клавиатуры вводит 5 оценок 
# студента. Определить, допущен ли студент к экзамену. 
# Студент получает допуск, если его средний балл 3 балла 
# и выше.

# Задание 6. Пользователь вводит с клавиатуры число. Если 
# оно четное, умножить его на три, иначе — поделить на 
# два. Результат вывести на экран.

# Задание 7. Написать программу-калькулятор. Пользователь 
# вводит два числа и выбирает арифметическое действие. 
# Вывести на экран результат



# !!!!!!!!Задание 3.
# Зарплата менеджера — 100$ + 5% от продаж. 
# Пользователь вводит с клавиатуры общую сумму сделок менеджера за месяц. 
# Посчитать итоговую зарплату менеджера.




# lesson_4_for_while

# Задание 1. Напишите программу, в которой в бексонечном цикле пользователь вводит два числа, а программа выводит их сумму.
# Затем программа запрашивает, надо ли завершить ввод. 
# И если пользователь вводит букву "Y" или "y", то происходит выход из бесконечного цикла, и программа завершается. 
# При нажатии любой другой клавиши, программа продолжает работу.

# Задание 2. Написать имитацию кассового аппарата для 
# магазина, торгующего новогодними товарами. Кассир 
# должен выбрать товар из списка, ввести его количество, 
# затем выбрать следующий товар. По завершению ввода 
# вывести на экран всю сумму покупки. Предусмотреть 
# наличие скидки. В списке товаров должно быть не меньше 
# 4-х товаров, должна отображаться их цена. Предусмотреть 
# неправильно вводимые данные.
# . Хранение общей выручки магазина;
# . Ограничить количество товара в магазине

# Задание 3. Написать программу, которая проверяет пользователя на знание таблицы умножения. Программа выводит на экран два числа, пользователь должен ввести их 
# произведение. Разработать несколько уровней сложности 
# (отличаются сложностью и количеством вопросов). Вывести пользователю оценку его знаний.

12 * 13






# lesson_6_list

# Задание 1. Написать, программу, которая вычисляет прибыль фирмы за 6 месяцев. Пользователь вводит прибыль 
# фирмы за каждый месяц.

# Задание 2. Написать программу, которая выводит список в обратном порядке 
# (можно использовать только метод len() - строка 40).

# Задание 3. Пользователь вводит длину сторон пятиугольника, каждая сторона заноситься в список, необходимо 
# вычислить периметр пятиугольника (периметр — сумма всех сторон).

# Задание 4. Пользователь вводит прибыль фирмы за год 
# (12 месяцев). Необходимо определить месяц, в котором 
# прибыль была максимальна и месяц, в котором прибыль 
# была минимальна

# Задание 5. Дана температура воздуха за каждый день января. 
# Определить:
# а) среднюю температуру за месяц;
# б) сколько раз температура воздуха опускалась нижеуказанной метки.