
# lesson 1 number

# задача 1
# Дана диагональ телевизора в дюймах. Написать программу, определяющую эту же диагональ в сантиметрах 
# (1 дюйм = 2.54 сантиметров).
# Ниже представлен пример для проверки программы 
# на корректностью

# задача 2
# Емкость аккумулятора смартфона составляет N мАч. 
# Написать программу, определяющую минимальную 
# емкость переносного зарядного устройства (powerbank), 
# если необходимо 3 полных заряда смартфона.
# Ниже представлен пример для проверки программы 
# на корректность.

# задача 3
# Напишите программу, которая вычисляем объём шара.

# задача 4
# Написать программу вычисления расстояния 
# между двумя точками.

