
# bool - логический тип данных
# num_bool_1 = True
# num_bool_2 = False

# условие
# num_1 = 4
# if(num_1 == 3):
#     print("ok")
# print("end")


# условие принимает только bool
# if(True):
#     print("num_bool_True")



# Логические операторы:
# print("2 == 2  = " , 2 == 2) # если ровно
# print("2 != 2  = " , 2 != 2) # если неровно
# print("2 < 5  = " , 2 < 5) # если меньше 
# print("2 > 5  = " , 2 > 5) # если больше 
# print("2 <= 5  = " , 2 <= 5) # если меньше и ровно
# print("2 >= 5  = " , 2 >= 5) # если больше и ровно


# print("-------------------")
# различие между < и <=
# print("2 < 2  = " , 2 < 2)
# print("2 <= 2  = " , 2 <= 2)



# else - иначе
# if(num_1 > 20):
#     print("num_1 < 20")
# else:
#     print("нет")



# условные операторы and , or
# print(True and False)
# print(True or False)
print((True or False)and(True or False))



# работа с условным оператором
# if(num_1 < 20 and num_1 == 4):
#     print("num_1 < 20")
    



# это трое разных условий
# num_2 = 7
# if(num_2 != 20):
#     print("if 3  num_2 != 20")
# if(num_2 == 7):
#     print("if 1  num_2 == 7")
# if(num_2 < 10):
#     print("if 2  num_2 < 10")
# else:
#     print("else")



# это цепочка из трех условий 
# elif - иначе if
# num_2 = 20
# if(num_2 == 7):
#     print("if 1  num_2 == 7")
# elif(num_2 < 10):
#     print("if 2  num_2 < 10")
# elif(num_2 != 20):
#     print("if 3  num_2 != 20")
# else:
#     print("else")








# Задание 1
# num = input("--")
# num = int(num)
# print(type(num))

# print(num % 2)

# if(num % 2 == 0):
#     print("четное")
# else:
#     print("нечетное")


# -------------



